{
 "status": "ok",
 "totalResults": 14991,
 "articles": [
  {
   "source": {
    "id": "wired",
    "name": "Wired"
   },
   "author": "Ramin Skibba",
   "title": "The Euclid Space Telescope’s Spectacular First Photos of Distant and Hidden Galaxies",
   "description": "Images from the European Space Agency’s newest telescope show the power of instruments that will create 3D surveys of a third of the sky, covering 10 billion years of cosmic history.",
   "url": "https://www.wired.com/story/the-euclid-space-telescopes-spectacular-first-photos-of-distant-and-hidden-galaxies/",
   "urlToImage": "https://media.wired.com/photos/654971d21147e009b3f09656/191:100/w_1280,c_limit/Perseus-Euclid-ERO-Perseus.26K26K.Crop7.jpg",
   "publishedAt": "2023-11-07T13:38:37Z",
   "content": "Scientists leading the European Space Agencys Euclid space telescope mission have just released its breathtaking first science images, taken only four months after launch. These new space photos reve… [+2111 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Gizmodo.com"
   },
   "author": "Passant Rabie",
   "title": "Astronaut Tool Bag Becomes Unexpected Satellite After ISS Spacewalk Slip-Up",
   "description": "In space, misplacing a bag of tools is hard to recover from. A tiny mishap during a recent spacewalk outside the International Space Station (ISS) has led to a new object in the night sky, with a tool bag now orbiting Earth ahead of the space station, tempora…",
   "url": "https://gizmodo.com/iss-tool-bag-orbits-earth-space-junk-1850998462",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/e5075e76f063a989327872b565e24b15.jpg",
   "publishedAt": "2023-11-07T16:55:00Z",
   "content": "In space, misplacing a bag of tools is hard to recover from. A tiny mishap during a recent spacewalk outside the International Space Station (ISS) has led to a new object in the night sky, with a too… [+1768 chars]"
  },
  {
   "source": {
    "id": "wired",
    "name": "Wired"
   },
   "author": "Ramin Skibba",
   "title": "How a Scientist and Cartoonist Envision Living on the Moon and Mars",
   "description": "In A City on Mars, Kelly and Zach Weinersmith imagine what it would really be like to live in space: thrilling and absolutely grueling.",
   "url": "https://www.wired.com/story/how-a-scientist-and-cartoonist-envision-living-on-the-moon-and-mars/",
   "urlToImage": "https://media.wired.com/photos/654ad76a428f34179e6b33c0/191:100/w_1280,c_limit/sci-Art054.jpg",
   "publishedAt": "2023-11-08T12:00:00Z",
   "content": "By the 2030s, if NASAs and other space agencies plans come to fruition, astronauts and the occasional tourist group will frequently visit the moon. Not long after that, theyll be able to live for ext… [+2006 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Gizmodo.com"
   },
   "author": "Isaac Schultz",
   "title": "Skeletal Hand-Like Structure Found Lurking in Deep Space",
   "description": "Captured through the powerful lens of X-ray telescopes, the ethereal expanse of a pulsar wind nebula is revealed in unprecedented detail.",
   "url": "https://gizmodo.com/skeletal-hand-structure-deep-space-x-ray-telescopes-1850976583",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/84f379a5cc826cba30834b1be0e6ca79.jpg",
   "publishedAt": "2023-10-31T16:45:00Z",
   "content": "Move over, Pillars of Creationtheres a new show in town and its called MSH 15-52. Catchy, we know.\r\nOkay, really its not a new showbetter to call it a revival. The eerie pulsar wind nebula spreads fr… [+2627 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Lifehacker.com"
   },
   "author": "Becca Lewis",
   "title": "How to Add a Light Switch to Any Existing Outlet",
   "description": "If you have a room with no overhead light fixture, or one in which the main light switch isn’t convenient, you can solve your problem by adding a switch to one of your power outlets to control a lamp instead. Whether it’s in an entryway, bedroom, or some othe…",
   "url": "https://lifehacker.com/how-to-add-a-light-switch-to-any-existing-outlet-1850988750",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/13f20375e429a2a122b57bffed647eb4.jpg",
   "publishedAt": "2023-11-03T14:00:13Z",
   "content": "If you have a room with no overhead light fixture, or one in which the main light switch isnt convenient, you can solve your problem by adding a switch to one of your power outlets to control a lamp … [+3765 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Lifehacker.com"
   },
   "author": "Becca Lewis",
   "title": "These DIY Room Dividers Can Help Break Up Your Open Floor Plan",
   "description": "If your open floor plan is a little too open, or if you want to carve out some defined space for focused use, room dividers can come in handy. Since most types of room dividers are much simpler and less expensive than a renovation, they’re a good solution for…",
   "url": "https://lifehacker.com/these-diy-room-dividers-can-help-break-up-your-open-flo-1850997451",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/68d7c9b0c3d1b7977ba8ca9e692f9ce2.jpg",
   "publishedAt": "2023-11-07T13:30:00Z",
   "content": "If your open floor plan is a little too open, or if you want to carve out some defined space for focused use, room dividers can come in handy. Since most types of room dividers are much simpler and l… [+3285 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Gizmodo.com"
   },
   "author": "Passant Rabie",
   "title": "Curing the Space Blues: Vive VR Headset for Astronauts' Mental Health Heads to ISS",
   "description": "Nearing the end of an unintended year in space, NASA astronaut Frank Rubio reflected on Earthly pleasures that he was eager to indulge in as soon as he returned home. “I think just going out in the yard and enjoying the trees and the silence,” Rubio said duri…",
   "url": "https://gizmodo.com/htc-vive-vr-headset-anchor-update-space-station-iss-1850980457",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/2072c25c50fbe6a476b140c0fb7f411f.jpg",
   "publishedAt": "2023-11-02T13:20:00Z",
   "content": "Nearing the end of an unintended year in space, NASA astronaut Frank Rubio reflected on Earthly pleasures that he was eager to indulge in as soon as he returned home. I think just going out in the ya… [+4273 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Gizmodo.com"
   },
   "author": "Passant Rabie",
   "title": "Seeing Double: Lucy’s First Target Asteroid Has a Tiny Moon",
   "description": "As NASA’s Lucy spacecraft zoomed past its first asteroid on Wednesday, its mission scientists made a surprising discovery of a bonus space rock.Read more...",
   "url": "https://gizmodo.com/nasa-lucy-dinkinesh-asteroid-binary-jupiter-trojans-1850989545",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/d9205da30ee32a4ce35119bc928a414f.jpg",
   "publishedAt": "2023-11-03T15:30:00Z",
   "content": "As NASAs Lucy spacecraft zoomed past its first asteroid on Wednesday, its mission scientists made a surprising discovery of a bonus space rock.\r\nThe first images sent over by the Lucy mission of its … [+2778 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Gizmodo.com"
   },
   "author": "Passant Rabie",
   "title": "How to Watch NASA’s Rare All-Woman Spacewalk Live",
   "description": "Two NASA astronauts are gearing up for their first spacewalk outside the International Space Station (ISS) for maintenance work in low Earth orbit, marking just the second time two women will exit the station together.Read more...",
   "url": "https://gizmodo.com/how-watch-nasa-rare-all-woman-spacewalk-live-1850976554",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/67fa8673fc365a62b27206a43d51d603.jpg",
   "publishedAt": "2023-10-31T15:56:00Z",
   "content": "Two NASA astronauts are gearing up for their first spacewalk outside the International Space Station (ISS) for maintenance work in low Earth orbit, marking just the second time two women will exit th… [+1620 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Lifehacker.com"
   },
   "author": "Stephen Johnson",
   "title": "What People Are Getting Wrong This Week: The 'Dead Internet Theory' Isn't Real, I Swear",
   "description": "Is the internet dead? Proponents of the Dead Internet Theory believe that the internet, as we understand it, doesn’t exist. It died around 2016, and since then, everything we see online, from Instagram pictures to this post on Lifehacker, has been generated b…",
   "url": "https://lifehacker.com/what-people-are-getting-wrong-this-week-the-dead-inter-1850983564",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/be48b843850c5a17cc288af8eb8078d0.jpg",
   "publishedAt": "2023-11-02T12:30:00Z",
   "content": "Is the internet dead? Proponents of the Dead Internet Theory believe that the internet, as we understand it, doesnt exist. It died around 2016, and since then, everything we see online, from Instagra… [+6624 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Lifehacker.com"
   },
   "author": "Jeff Somers",
   "title": "How to Sleep on a Couch Without Hurting Yourself",
   "description": "Much is uncertain in this life, but one thing is for sure: At some point in your future, you will be forced to sleep on a couch. No matter how old and successful you become, the possibility that you will be required to sleep on a couch like a college kid with…",
   "url": "https://lifehacker.com/how-to-sleep-on-a-couch-without-hurting-yourself-1850985809",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/3c8d45c43b54f3393ac881300a158f68.jpg",
   "publishedAt": "2023-11-02T17:00:00Z",
   "content": "Much is uncertain in this life, but one thing is for sure: At some point in your future, you will be forced to sleep on a couch. No matter how old and successful you become, the possibility that you … [+3046 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Gizmodo.com"
   },
   "author": "Kyle Barr",
   "title": "The MacBook Pro is Back in Black, Now Powered with M3",
   "description": "It’s Halloween eve, and Apple brought along a few new desktop products to bask in the dark joys of spooky season, most notably a new Space Black color for the company’s leading laptops. Gizmodo had the opportunity to trick or treat through the new M3-powered …",
   "url": "https://gizmodo.com/the-macbook-pro-is-back-in-black-now-powered-with-m3-1850975312",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/8234e0778a5c2d50a923ee145a353de9.jpg",
   "publishedAt": "2023-10-31T02:35:00Z",
   "content": "Its Halloween eve, and Apple brought along a few new desktop products to bask in the dark joys of spooky season, most notably a new Space Black color for the companys leading laptops. Gizmodo had the… [+1634 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Gizmodo.com"
   },
   "author": "Justin Carter",
   "title": "Echo Will Begin Marvel's Spotlight Era",
   "description": "Just a few days ago, Marvel Studios revealed the first footage its upcoming series Echo. Previously meant for 2023 before getting knocked to 2024 in order to space things out, the Hawkeye spinoff sees Maya Lopez (Alaqua Cox) return home after having just viol…",
   "url": "https://gizmodo.com/echo-series-marvel-spotlight-tv-banner-1850993518",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/e37b91eee1fc968f48806ab99b95c990.jpg",
   "publishedAt": "2023-11-05T18:50:00Z",
   "content": "Just a few days ago, Marvel Studios revealed the first footage its upcoming series Echo. Previously meant for 2023 before getting knocked to 2024 in order to space things out, the Hawkeye spinoff see… [+1958 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Gizmodo.com"
   },
   "author": "Justin Carter",
   "title": "Director Makoto Shinkai to Get Academy Museum Installment",
   "description": "Since 1998, Makoto Shinkai has grown to become one of Japan’s most celebrated creators in the animation space thanks to works like Weathering With You, Your Name, and 2022's Suzume (which released earlier this year for international audiences). After last wee…",
   "url": "https://gizmodo.com/makoto-shinkai-career-retrospective-museum-installation-1850993640",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/27ccd08d18b0a34aed9e8295175ea6b8.jpg",
   "publishedAt": "2023-11-05T19:45:00Z",
   "content": "Since 1998, Makoto Shinkai has grown to become one of Japans most celebrated creators in the animation space thanks to works like Weathering With You, Your Name, and 2022's Suzume (which released ear… [+1665 chars]"
  },
  {
   "source": {
    "id": "engadget",
    "name": "Engadget"
   },
   "author": "Sam Rutherford",
   "title": "Apple updates its 14-inch and 16-inch MacBook Pros with new M3 chips",
   "description": "On Monday at its “Scary Fast” event, Apple announced an updated line of 14- and 16-inch MacBook Pros featuring a range of new M3 chips and Space Black chassis.\nCompared to a similarly specced M2 model, a base M3 14-inch MacBook Pro will now start at $1,599 ($…",
   "url": "https://www.engadget.com/apple-updates-its-14-inch-and-16-inch-macbook-pros-with-new-m3-chips-specs-price-003015893.html",
   "urlToImage": "https://s.yimg.com/ny/api/res/1.2/TvmiZepuC1JkuFFLHYnCsw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2023-10/9cca7880-7783-11ee-af3f-5c2e7a187a88",
   "publishedAt": "2023-10-31T00:30:15Z",
   "content": "On Monday at its Scary Fast event, Apple announced an updated line of 14- and 16-inch MacBook Pros featuring a range of new M3 chips and Space Black chassis.\r\nCompared to a similarly specced M2 model… [+2618 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Lifehacker.com"
   },
   "author": "Jessica Kanzler",
   "title": "This Portable Bluetooth Wireless Neckband Speaker Is $37.99",
   "description": "These portable Bluetooth wireless neckband speakers give you more freedom to move about while you listen to music or podcasts—and right now, they’re sale for $37.99 (regularly $39); no coupon code is required.Read more...",
   "url": "https://lifehacker.com/this-portable-bluetooth-wireless-neckband-speaker-is-3-1850974647",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/16981cedbe4dd4c841ca3163316a75d4.png",
   "publishedAt": "2023-10-31T19:30:00Z",
   "content": "These portable Bluetooth wireless neckband speakers give you more freedom to move about while you listen to music or podcastsand right now, theyre sale for $37.99 (regularly $39); no coupon code is r… [+532 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Gizmodo.com"
   },
   "author": "Passant Rabie",
   "title": "NASA Apologizes for Not Supporting Your Delulu Plans to Visit Jupiter",
   "description": "NASA issued an apology for a slightly shady post on X that questioned people’s ability to visit Jupiter.Read more...",
   "url": "https://gizmodo.com/nasa-apology-jupiter-spacex-travel-humans-mars-1850987118",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/410d5d8cae01ba8fc6ec18d93598369d.jpg",
   "publishedAt": "2023-11-02T20:55:00Z",
   "content": "NASA issued an apology for a slightly shady post on X that questioned peoples ability to visit Jupiter.\r\nIn a recent social media post, NASA wrote, Is visiting Jupiter on your bucket list? Lets face … [+2585 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Boing Boing"
   },
   "author": "Ruben Bolling",
   "title": "Space Mountain, with the lights on",
   "description": "Former Disney Imagineer Eddie Sotto posted this video of Disneyland (Anaheim)'s Space Mountain in 1998, with the lights on. The ride normally operates in darkness, so it's interesting to get a glimpse of what the track and interior actually look like. — Read …",
   "url": "https://boingboing.net/2023/10/31/space-mountain-with-the-lights-on.html",
   "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2023/10/Screen-Shot-2023-10-30-at-9.15.25-PM.png?fit=1200%2C728&ssl=1",
   "publishedAt": "2023-10-31T14:45:04Z",
   "content": "Former Disney Imagineer Eddie Sotto posted this video of Disneyland (Anaheim)'s Space Mountain in 1998, with the lights on. The ride normally operates in darkness, so it's interesting to get a glimps… [+1219 chars]"
  },
  {
   "source": {
    "id": "ars-technica",
    "name": "Ars Technica"
   },
   "author": "Stephen Clark",
   "title": "After leading NASA’s mission to Pluto, Alan Stern flies to space himself",
   "description": "Virgin Galactic is finally settling into a routine after years of delays.",
   "url": "https://arstechnica.com/space/2023/11/after-leading-nasas-mission-to-pluto-alan-stern-flies-to-space-himself/",
   "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/11/galactic05space-760x380.jpeg",
   "publishedAt": "2023-11-03T00:13:19Z",
   "content": "Enlarge/ The view of Earth's curved horizon from Virgin Galactic's SpaceShipTwo rocketplane.\r\n27 with \r\nIt has been fun to watch Virgin Galactic string together six flights to suborbital space this y… [+5881 chars]"
  },
  {
   "source": {
    "id": "ars-technica",
    "name": "Ars Technica"
   },
   "author": "Stephen Clark",
   "title": "Scientists show off the wide vision of Europe’s Euclid space telescope",
   "description": "The $1.5 billion Euclid telescope will use light to study the dark Universe.",
   "url": "https://arstechnica.com/space/2023/11/scientists-show-off-the-wide-vision-of-europes-euclid-space-telescope/",
   "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/11/euclid1-760x380.jpg",
   "publishedAt": "2023-11-08T18:34:44Z",
   "content": "Enlarge/ One of the first galaxies that Euclid observed is nicknamed the \"Hidden Galaxy.\" This galaxy, also known as IC 342 or Caldwell 5, is difficult to observe because it lies behind the busy disk… [+3185 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Lifehacker.com"
   },
   "author": "Lindsey Ellefson",
   "title": "You Should Make a 'To-Don't List'",
   "description": "You’ve heard of a to-do list, but what you might really need is a to-don’t list. Instead of focusing on all the tasks you have to get done, it could be beneficial for you to look at everything you don’t need to or even shouldn’t do. It sounds like a waste of …",
   "url": "https://lifehacker.com/you-should-make-a-to-dont-list-1851002808",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/261a92468ac42b73d6c1d7875ad3739a.jpg",
   "publishedAt": "2023-11-08T17:00:00Z",
   "content": "Youve heard of a to-do list, but what you might really need is a to-dont list. Instead of focusing on all the tasks you have to get done, it could be beneficial for you to look at everything you dont… [+3103 chars]"
  },
  {
   "source": {
    "id": "engadget",
    "name": "Engadget"
   },
   "author": "Igor Bonifacic",
   "title": "The best gifts for gamers in 2023",
   "description": "Let’s face it, buying a gift for someone who loves gaming is tough, especially this year. The past 12 months were jam-packed with some of the best releases in recent memory. While we at Engadget cover games extensively, our staff is full of people who genuine…",
   "url": "https://www.engadget.com/best-gaming-gifts-for-gamers-150008483.html",
   "urlToImage": "https://s.yimg.com/ny/api/res/1.2/4lng91yGKxM4GX8MN_5OJA--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NjA-/https://s.yimg.com/os/creatr-uploaded-images/2023-10/97af3580-72a0-11ee-bbcd-63ce21a17746",
   "publishedAt": "2023-11-01T15:00:08Z",
   "content": "After more than two decades of iteration, its hard to find a fault with Microsofts Xbox controllers. The latest Series X/S version refines a design that was already excellent with the Xbox One, but i… [+640 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "MacRumors"
   },
   "author": "Joe Rossignol",
   "title": "Apple's USB-C to MagSafe 3 Cable Now Available to Order in Space Black",
   "description": "The new 14-inch and 16-inch MacBook Pro models announced today are available in a new Space Black finish when configured with M3 Pro or M3 Max chips. Accordingly, Apple has released its USB-C to MagSafe 3 cable in Space Black for $49.\n\n\n\n\n\nApple already inclu…",
   "url": "https://www.macrumors.com/2023/10/30/usb-c-to-magsafe-3-cable-space-black/",
   "urlToImage": "https://images.macrumors.com/t/ArlVYAKUBL4CzhKJoiLAQ5vuTSw=/2500x/article-new/2023/10/MacBook-Pro-Space-Black-Topdown-Feature.jpg",
   "publishedAt": "2023-10-31T00:54:34Z",
   "content": "The new 14-inch and 16-inch MacBook Pro models announced today are available in a new Space Black finish when configured with M3 Pro or M3 Max chips. Accordingly, Apple has released its USB-C to MagS… [+677 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Android Central"
   },
   "author": "michael.hicks@futurenet.com (Michael L Hicks)",
   "title": "Uninstalling Android apps on other devices is about to become a lot easier",
   "description": "Need to clear out some storage space or remove an app from your phone, tablet, watch, and Chromebook at once? It's about to become a lot easier.",
   "url": "https://www.androidcentral.com/apps-software/play-store-update-enables-remote-uninstall-apps",
   "urlToImage": "https://cdn.mos.cms.futurecdn.net/AhaX4oiMTLreQSzTcsAWn7-1200-80.jpg",
   "publishedAt": "2023-11-07T20:00:31Z",
   "content": "<ul><li>The November Google Play Store update will let you \"uninstall apps on connected devices\" using your phone.</li><li>This feature could target Android tablets, Android TV boxes, Wear OS watches… [+2238 chars]"
  },
  {
   "source": {
    "id": "business-insider",
    "name": "Business Insider"
   },
   "author": "Grace Eliza Goodwin",
   "title": "NASA's James Webb and X-ray telescopes found a primordial black hole growing in the early universe just after the Big Bang",
   "description": "NASA's James Webb Space Telescope found the most distant black hole ever growing near the dawn of time.",
   "url": "https://www.businessinsider.com/nasa-black-hole-james-webb-space-telescope-discovery-early-universe-2023-11",
   "urlToImage": "https://i.insider.com/654bad0c36d588dc55ccf456?width=1200&format=jpeg",
   "publishedAt": "2023-11-08T16:08:33Z",
   "content": "X-ray image of the msot distant black hole ever discovered.X-ray: NASA/CXC/SAO/Ákos Bogdán; Infrared: NASA/ESA/CSA/STScI; Image Processing: NASA/CXC/SAO/L. Frattare & K. Arcand\r\n<ul><li>NASA has disc… [+1843 chars]"
  },
  {
   "source": {
    "id": "business-insider",
    "name": "Business Insider"
   },
   "author": "Jordan Hart",
   "title": "Kendrick Lamar's company just dropped a limited-edition 'dumb' phone. It's already sold out.",
   "description": "Kendrick Lamar is entering the tech space with a collaboration on the Light Phone 2 that's designed to be simplistic.",
   "url": "https://www.businessinsider.com/kendrick-lamar-launches-limited-edition-light-phone-2-2023-11",
   "urlToImage": "https://i.insider.com/65450ffb36d588dc55ca3715?width=1200&format=jpeg",
   "publishedAt": "2023-11-03T17:00:26Z",
   "content": "Kendrick Lamar's creative agency collaborated with a tech company to produce a new phone.pgLang\r\n<ul><li>Kendrick Lamar enters the tech space with a collaboration on the Light Phone 2.</li><li>Lamar'… [+1877 chars]"
  },
  {
   "source": {
    "id": "wired",
    "name": "Wired"
   },
   "author": "Matt Simon",
   "title": "The Ultra-Efficient Farm of the Future Is in the Sky",
   "description": "Take a tour of a rooftop laboratory where scientists show how growing crops under solar panels can produce both food and clean energy.",
   "url": "https://www.wired.com/story/the-ultra-efficient-farm-of-the-future-is-in-the-sky/",
   "urlToImage": "https://media.wired.com/photos/65429e91ef12892fe0b649cb/191:100/w_1280,c_limit/SCIENCE-ROOFTOP-53290275178_6bfe32ddd9_o-(1).jpg",
   "publishedAt": "2023-11-02T11:00:00Z",
   "content": "Five stories off the ground at Colorado State University, a highly unlikely garden grows under a long row of rooftop solar panels. Its late October at 9 am, when the temperature is 30 degrees Fahrenh… [+1146 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Hackaday"
   },
   "author": "Donald Papp",
   "title": "What The Artisan 3-in-1 CNC Offers (If One Has The Table Space)",
   "description": "I never feel like I have enough space in my workshop. The promise of consolidating tools to make the most of limited space drew me to the Snapmaker Artisan, a plus-sized 3-in-1 tool combining 3D pr…",
   "url": "https://hackaday.com/2023/11/01/what-the-artisan-3-in-1-cnc-offers-if-one-has-the-table-space/",
   "urlToImage": "https://hackaday.com/wp-content/uploads/2023/10/post-MDF-dust_featured.png",
   "publishedAt": "2023-11-01T14:00:47Z",
   "content": "I never feel like I have enough space in my workshop. The promise of consolidating tools to make the most of limited space drew me to the Snapmaker Artisan, a plus-sized 3-in-1 tool combining 3D prin… [+11233 chars]"
  },
  {
   "source": {
    "id": "business-insider",
    "name": "Business Insider"
   },
   "author": "Eliza Relman",
   "title": "Urban golf courses are making housing more expensive and parks harder to access — and taxpayers are footing the bill",
   "description": "Golf is played by just a fraction of city residents, but urban courses take up a ton of valuable space and non-golfers foot the bill.",
   "url": "https://www.businessinsider.com/golf-courses-rent-real-estate-more-expensive-parks-cost-taxpayers-2023-11",
   "urlToImage": "https://i.insider.com/6545138f3cc84b4dfafbe402?width=1200&format=jpeg",
   "publishedAt": "2023-11-05T11:23:02Z",
   "content": "Homes line the Harding Park Golf Course in San Francisco, California, a publicly-owned municipal golf course owned by the City and County.David Madison/Getty Images\r\n<ul><li>Urban golf courses are us… [+9983 chars]"
  },
  {
   "source": {
    "id": "business-insider",
    "name": "Business Insider"
   },
   "author": "Dan DeFrancesco",
   "title": "Sam Bankman-Fried was just convicted. Where does crypto go from here?",
   "description": "Sam Bankman-Fried's conviction closes a dark chapter for the crypto industry. But the future of the space still seems murky.",
   "url": "https://www.businessinsider.com/news-today-november-3-sam-bankman-fried-crypto-ftx-trial-2023-11",
   "urlToImage": "https://i.insider.com/653a92d496f7540cd066a733?width=1200&format=jpeg",
   "publishedAt": "2023-11-03T13:32:00Z",
   "content": "Chelsea Jia Feng/Insider\r\n<ul>\n<li>This post originally appeared in the Insider Today newsletter.</li>\n<li>You can sign up for Insider's daily newsletter here.</li>\n</ul>Happy Friday! Start your day … [+8251 chars]"
  },
  {
   "source": {
    "id": "business-insider",
    "name": "Business Insider"
   },
   "author": "Kevin Webb",
   "title": "The best SSD for PS5 in 2023: Top M.2 solid state drives",
   "description": "The best solid state drives for PS5 allow you to expand your console's storage space so you can play more games and enjoy super-fast loading times.",
   "url": "https://www.businessinsider.com/guides/tech/best-ssd-for-ps5",
   "urlToImage": "https://i.insider.com/654a7022b788914e5551bdf8?width=1200&format=jpeg",
   "publishedAt": "2023-11-07T21:38:39Z",
   "content": "When you buy through our links, Insider may earn an affiliate commission. Learn moreThe best SSDs for PS5 can deliver incredibly fast loading times with new PlayStation 5 games.Insider\r\nThe PS5 allow… [+8805 chars]"
  },
  {
   "source": {
    "id": "business-insider",
    "name": "Business Insider"
   },
   "author": "Maiya Focht",
   "title": "First photos from the Euclid space telescope show thousands of distant, hidden, and irregular galaxies that could help solve 2 of astronomy's grandest mysteries",
   "description": "The Euclid space telescope's first photos were revealed today. The images show the Horsehead Nebula and Perseus cluster in a huge, unseen scope.",
   "url": "https://www.businessinsider.com/esa-euclid-space-telescope-images-horsehead-nebula-perseus-cluster-photos-2023-11",
   "urlToImage": "https://i.insider.com/654ab33fb788914e55521a11?width=1200&format=jpeg",
   "publishedAt": "2023-11-08T00:56:27Z",
   "content": "Euclid's view of irregular galaxy NGC 6822.European Space Agency/Euclid Consortium/NASA; image processing by J.-C. Cuillandre, G. Anselmi\r\n<ul><li>The Euclid space telescope returned its first photos… [+5486 chars]"
  },
  {
   "source": {
    "id": "the-verge",
    "name": "The Verge"
   },
   "author": "Wes Davis",
   "title": "The copyright fight over Fortnite dance moves is back on",
   "description": "An appeals court reversed the dismissal of a copyright lawsuit filed against Epic Games by choreographer Kyle Hanagami, which accused the Fortnite maker of copying his dance moves for an in-game emote.",
   "url": "https://www.theverge.com/2023/11/4/23946260/epic-fortnite-choreography-emote-lawsuit-ruling-overturned",
   "urlToImage": "https://cdn.vox-cdn.com/thumbor/PGHKfo-anEYmrQmzreV1zbrN_Yw=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/23932925/acastro_STK108__03.jpg",
   "publishedAt": "2023-11-04T20:31:42Z",
   "content": "The copyright fight over Fortnite dance moves is back on\r\nThe copyright fight over Fortnite dance moves is back on\r\n / As old maps return to Fortnite, so do old battles over who owns some of the emot… [+2859 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Lifehacker.com"
   },
   "author": "Khamosh Pathak",
   "title": "How to Clear the Cache on Your iPhone",
   "description": "Your iPhone does a pretty good job of managing memory and RAM on its own. It’s so good, in fact, that you don’t need to quit running apps (unless the act of flipping apps is your way of relaxing). But there’s one place where unnecessary junk and cache does bu…",
   "url": "https://lifehacker.com/how-to-clear-the-cache-on-your-iphone-1850998050",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/e99f28fd56e6592aac1c5f97bcbf9b87.jpg",
   "publishedAt": "2023-11-07T14:00:00Z",
   "content": "Your iPhone does a pretty good job of managing memory and RAM on its own. Its so good, in fact, that you dont need to quit running apps (unless the act of flipping apps is your way of relaxing). But … [+1767 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Design-milk.com"
   },
   "author": "Kelly Beall",
   "title": "Meet the Much Anticipated Bird Sofa Collection",
   "description": "EQ3's Bird Sofa Collection embodies a comfort-driven timeless aesthetic that will effortlessly complement other furniture and transition throughout the years as your space evolves.",
   "url": "https://design-milk.com/meet-the-much-anticipated-bird-sofa-collection/",
   "urlToImage": "https://design-milk.com/images/2023/08/Bird-Sofa-Collection-EQ3-Featured-Image.jpg",
   "publishedAt": "2023-11-03T14:00:58Z",
   "content": "Inspired by the casual lounge vibe and artistic flair of the 1970s, EQ3’s new Bird Collection has been thoughtfully designed with versatility in mind. Completely modular, Bird uses a simple hidden cl… [+944 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "NPR"
   },
   "author": "Russell Lewis",
   "title": "Astronaut Ken Mattingly, who flew to the moon on Apollo 16, has died at 87",
   "description": "He piloted Apollo 16 and commanded the shuttle. But he may be best known for the mission he didn't fly: the ill-fated Apollo 13. And he worried late in life about the high cost of human space flight.",
   "url": "https://www.npr.org/2023/11/02/517140750/nasa-astronaut-ken-mattingly-apollo-16-13-died-moon-shuttle",
   "urlToImage": "https://media.npr.org/assets/img/2017/04/11/ap_700314079_wide-ac3bb71fecad5ad8f902a3a282e5126bdfcce3eb-s1400-c100.jpg",
   "publishedAt": "2023-11-02T20:42:20Z",
   "content": "Retired astronaut Ken Mattingly has died. He's pictured (center) with crewmates Jim Lovell (left) and Fred Haise (right) at a news conference about a mission he ended up missing, the ill-fated Apollo… [+3416 chars]"
  },
  {
   "source": {
    "id": "engadget",
    "name": "Engadget"
   },
   "author": "Mat Smith",
   "title": "The Morning After: The final Beatles song was made with a little help from AI",
   "description": "The Beatles have released another song, the first since 1995. “Now and Then” is being advertised as the final Beatles track, given that two of the members have passed and the other two are well over 80 years old. But then again, millionaires do love money.\nTh…",
   "url": "https://www.engadget.com/the-morning-after-the-final-beatles-song-was-made-with-a-little-help-from-ai-111541406.html",
   "urlToImage": "https://s.yimg.com/os/creatr-uploaded-images/2023-11/833a74a0-7a2c-11ee-adf3-2b328f456f4f",
   "publishedAt": "2023-11-03T11:15:41Z",
   "content": "The Beatles have released another song, the first since 1995. Now and Then is being advertised as the final Beatles track, given that two of the members have passed and the other two are well over 80… [+3735 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "VentureBeat"
   },
   "author": "Dean Takahashi",
   "title": "XR Health’s VR headset for mental health will treat astronauts on space station",
   "description": "XRHealth, a healthcare spatial computing platform, will send a VR headset and mental health apps into space to treat astronauts at the ISS.",
   "url": "https://venturebeat.com/metaverse/xr-healths-vr-headset-for-mental-health-will-treat-astronauts-on-space-station/",
   "urlToImage": "https://venturebeat.com/wp-content/uploads/2023/11/NASA-training-at-Johnson-Space-Centre.jpg?w=1200&strip=all",
   "publishedAt": "2023-11-02T12:00:00Z",
   "content": "GamesBeat Next's on-demand library is now live! Start catching up on the 30+ sessions you might have missed.  Watch Now\r\nXRHealth, a healthcare spatial computing platform, will send a VR headset and … [+1246 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Boing Boing"
   },
   "author": "Grant St. Clair",
   "title": "Call of Duty: Modern Warfare 3 to take up staggering 213 gigabytes of storage space",
   "description": "It seems that Microsoft's recent acquisition of Call of Duty developer Activision-Blizzard hasn't done much to curb their data-hoarding practices. Call of Duty: Modern Warfare 3, which enters Early Access today, weighs in at a staggering 213 gigabytes of SSD-…",
   "url": "https://boingboing.net/2023/11/03/call-of-duty-modern-warfare-3-to-take-up-staggering-213-gigabytes-of-storage-space.html",
   "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2022/10/hamsterdam-scaled.jpg?fit=1200%2C656&ssl=1",
   "publishedAt": "2023-11-03T12:02:23Z",
   "content": "It seems that Microsoft's recent acquisition of Call of Duty developer Activision-Blizzard hasn't done much to curb their data-hoarding practices. Call of Duty: Modern Warfare 3, which enters Early A… [+772 chars]"
  },
  {
   "source": {
    "id": "engadget",
    "name": "Engadget"
   },
   "author": "Mariella Moon",
   "title": "Sony ANC headphones are up to 53 percent off at Amazon",
   "description": "A bunch of Sony headphones, earbuds and other audio devices are on sale at Amazon, including the Sony WH-CH720N headset, which is currently selling for the lowest price we've seen for it on the website. You can get the noise canceling wireless headphones for …",
   "url": "https://www.engadget.com/sony-anc-headphones-are-up-to-53-percent-off-at-amazon-095038076.html",
   "urlToImage": "https://s.yimg.com/ny/api/res/1.2/g.iaGctlyhcS4.kXu1UUkg--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD04MDI-/https://s.yimg.com/os/creatr-uploaded-images/2023-11/941091a0-7898-11ee-b7fa-e2e022464f0f",
   "publishedAt": "2023-11-01T09:50:38Z",
   "content": "A bunch of Sony headphones, earbuds and other audio devices are on sale at Amazon, including the Sony WH-CH720N headset, which is currently selling for the lowest price we've seen for it on the websi… [+1976 chars]"
  },
  {
   "source": {
    "id": "ars-technica",
    "name": "Ars Technica"
   },
   "author": "Stephen Clark",
   "title": "In a surprise move, the military’s spaceplane will launch on Falcon Heavy",
   "description": "SpaceX's Falcon Heavy could send the X-37B into a higher orbit than before.",
   "url": "https://arstechnica.com/space/2023/11/in-a-surprise-move-the-militarys-spaceplane-will-launch-on-falcon-heavy/",
   "urlToImage": "https://cdn.arstechnica.net/wp-content/uploads/2023/11/221111-F-XX000-0003-2-760x380.jpg",
   "publishedAt": "2023-11-09T01:10:50Z",
   "content": "Enlarge/ The military's X-37B spaceplane landed last November to end the program's sixth mission.\r\n13 with \r\nThe US military's reusable X-37B spaceplane will launch on the next flight of SpaceX's Fal… [+3216 chars]"
  },
  {
   "source": {
    "id": "the-next-web",
    "name": "The Next Web"
   },
   "author": "Thomas Macaulay",
   "title": "‘Dark universe’ space mission reveals its first colour images of the cosmos",
   "description": "A spacecraft that’s exploring the dark universe has released its first full-colour images of the cosmos. Named Euclid after the ancient Greek “father of geometry,” the satellite was developed by the European Space Agency (ESA). Its mission: produce the world’…",
   "url": "https://thenextweb.com/news/esa-euclid-space-mission-releases-first-colour-images",
   "urlToImage": "https://img-cdn.tnwcdn.com/image/tnw-blurple?filter_last=1&fit=1280%2C640&url=https%3A%2F%2Fcdn0.tnwcdn.com%2Fwp-content%2Fblogs.dir%2F1%2Ffiles%2F2023%2F11%2FUntitled-design-1.jpg&signature=aebf51a6d4c161123a21b06e8506db4d",
   "publishedAt": "2023-11-07T13:15:43Z",
   "content": "A spacecraft thats exploring the dark universe has released its first full-colour images of the cosmos.\r\nNamed Euclid after the ancient Greek father of geometry, the satellite was developed by the Eu… [+5603 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Hackaday"
   },
   "author": "Jenny List",
   "title": "Need A Low-Mass Antenna In Space? Just Blow It Up!",
   "description": "A parabolic antenna is a simple enough device, a curved reflector designed to focus all the radiation from the direction it’s pointed into a waveguide or antenna at its feedpoint. …read more",
   "url": "https://hackaday.com/2023/10/31/need-a-low-mass-antenna-in-space-just-blow-it-up/",
   "urlToImage": "https://hackaday.com/wp-content/uploads/2023/10/inflatable-antenna-featured.jpg",
   "publishedAt": "2023-11-01T02:00:00Z",
   "content": "A parabolic antenna is a simple enough device, a curved reflector designed to focus all the radiation from the direction it’s pointed into a waveguide or antenna at its feedpoint. They’re easy enough… [+1695 chars]"
  },
  {
   "source": {
    "id": "bbc-news",
    "name": "BBC News"
   },
   "author": null,
   "title": "Fire tornado sweeps through Australian outback",
   "description": "There was 'absolutely nothing we could do but sit back and watch', the company who shared the video said.",
   "url": "https://www.bbc.co.uk/news/av/world-australia-67355485",
   "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/5C16/production/_131647532_p0grg8x3.jpg",
   "publishedAt": "2023-11-08T09:45:44Z",
   "content": "A video shared on social media shows a 'fiernado' sweeping through Tennant creek in Australia's Northern Territories.\r\nSilverBridle Contracting, a company working in the area at the time, posted the … [+553 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Gizmodo.com"
   },
   "author": "Passant Rabie",
   "title": "New Wearable Helps Astronauts Know Up From Down—Trusting It Is the Hard Part",
   "description": "A one way trip to the Red Planet would take up to nine months. During that time, astronauts on board the Mars-bound spacecraft could lose their sense of direction and ability to know up from down, making it difficult to orient themselves on the Martian surfac…",
   "url": "https://gizmodo.com/astronaut-wearable-disoriential-spatial-awareness-trust-1850996634",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/da45cbfcf9a0e63fa6097101a4b6e482.jpg",
   "publishedAt": "2023-11-07T21:05:00Z",
   "content": "A one way trip to the Red Planet would take up to nine months. During that time, astronauts on board the Mars-bound spacecraft could lose their sense of direction and ability to know up from down, ma… [+4741 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Gizmodo.com"
   },
   "author": "James Whitbrook",
   "title": "The Marvels' First Clip Is a Body Swapping Brawl",
   "description": "It’s hard to imagine that the next Marvel movie is out in just a few weeks, but here we are—The Marvels is set to fly into cinemas November 10 and we’re only just getting our first extended look at the film. At least it’s a pretty fun one?Read more...",
   "url": "https://gizmodo.com/the-marvels-first-clip-brie-larson-iman-vellani-mcu-1850976400",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/e74693725221bbc110bcabac9193795c.png",
   "publishedAt": "2023-10-31T15:00:00Z",
   "content": "Its hard to imagine that the next Marvel movie is out in just a few weeks, but here we areThe Marvels is set to fly into cinemas November 10 and were only just getting our first extended look at the … [+1048 chars]"
  },
  {
   "source": {
    "id": "the-verge",
    "name": "The Verge"
   },
   "author": "Tom Warren",
   "title": "Microsoft’s Windows 11 2023 Update arrives with Microsoft Teams changes",
   "description": "Microsoft is finally releasing its big Windows 11 2023 Update, but most of the new changes already appeared last month. The update includes changes to Microsoft Teams.",
   "url": "https://www.theverge.com/2023/10/31/23940033/microsoft-windows-11-2023-update-download-available",
   "urlToImage": "https://cdn.vox-cdn.com/thumbor/fK93c6-cYxSDq7Hq6VWqYT96VhM=/0x0:2040x1360/1200x628/filters:focal(1020x680:1021x681)/cdn.vox-cdn.com/uploads/chorus_asset/file/22900766/bfarsace_211004_4777_0003.jpg",
   "publishedAt": "2023-10-31T17:00:00Z",
   "content": "Microsofts Windows 11 2023 Update arrives with Microsoft Teams changes\r\nMicrosofts Windows 11 2023 Update arrives with Microsoft Teams changes\r\n / Windows 11 2023 Update includes all of the big new W… [+2026 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Lifehacker.com"
   },
   "author": "Allie Chanthorn Reinmann",
   "title": "Evil Week: Keep Your Snacks Out of Your Family's Filthy Paws",
   "description": "Welcome to Evil Week, our annual dive into all the slightly sketchy hacks we’d usually refrain from recommending. Want to weasel your way into free drinks, play elaborate mind games, or, er, launder some money? We’ve got all the info you need to be successful…",
   "url": "https://lifehacker.com/evil-week-keep-your-snacks-out-of-your-familys-filthy-1850976695",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/fa806d2c52de0d468a43ea57677e10f0.jpg",
   "publishedAt": "2023-10-31T16:30:00Z",
   "content": "Welcome to Evil Week, our annual dive into all the slightly sketchy hacks wed usually refrain from recommending. Want to weasel your way into free drinks, play elaborate mind games, or, er, launder s… [+3466 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Lifehacker.com"
   },
   "author": "Lindsey Ellefson",
   "title": "Use the 'Zen to Done' Method to Create New Productivity Habits",
   "description": "Productivity is an essential skill for getting this done in your life and career, but it’s also important because it can gives you a sense of accomplishment and enhances your sense of wellbeing. When you don’t get all your tasks done, it’s easy to feel overwh…",
   "url": "https://lifehacker.com/how-to-use-the-zen-to-done-productivity-method-1850986328",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/c3c21f6ef98a89934c14989c695f7200.jpg",
   "publishedAt": "2023-11-02T18:06:41Z",
   "content": "Productivity is an essential skill for getting this done in your life and career, but its alsoimportant because it can gives you a sense of accomplishment and enhances your sense of wellbeing. When y… [+3290 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Lifehacker.com"
   },
   "author": "Daniel Oropeza",
   "title": "These Are the Best Soundbar Deals During Walmart’s Black Friday Sale",
   "description": "Walmart’s early Black Friday deals are now live. They are the third major retailer after Target and Best Buy to kick off their Black Friday deals. Early Black Friday deals are actually good this year, and you should be checking them out if you haven’t already…",
   "url": "https://lifehacker.com/these-are-the-best-soundbar-deals-during-walmart-s-blac-1851004952",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/6f078fc9b30f6202f076e0e8d54e0f6a.jpg",
   "publishedAt": "2023-11-08T23:00:00Z",
   "content": "Walmarts early Black Friday deals are now live. They are the third major retailer after Target and Best Buy to kick off their Black Friday deals. Early Black Friday deals are actually good this year,… [+3059 chars]"
  },
  {
   "source": {
    "id": "engadget",
    "name": "Engadget"
   },
   "author": "Kris Holt",
   "title": "Apple's 'Scary Fast' Mac event: Everything announced about M3 MacBook Pro and M3 iMac",
   "description": "It’s perhaps The Addams Family’s favorite time of year, but Apple’s pre-Halloween “Scary Fast” event was neither mysterious nor spooky. Thanks to M3 chip leaks and rumors, all of the company’s announcements were largely expected. And though the showcase inexp…",
   "url": "https://www.engadget.com/apples-scary-fast-mac-event-everything-announced-about-m3-macbook-pro-and-m3-imac-153056716.html",
   "urlToImage": "https://s.yimg.com/ny/api/res/1.2/uEuDeS768eKMuREXngaAqQ--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02NzU-/https://s.yimg.com/os/creatr-uploaded-images/2023-10/66a04ef0-77fc-11ee-aafb-f953a745c14b",
   "publishedAt": "2023-10-31T15:30:56Z",
   "content": "Its perhaps The Addams Familys favorite time of year, but Apples pre-Halloween Scary Fast event was neither mysterious nor spooky. Thanks to M3 chip leaks and rumors, all of the companys announcement… [+5622 chars]"
  },
  {
   "source": {
    "id": "business-insider",
    "name": "Business Insider"
   },
   "author": "Grace Kay",
   "title": "See inside the prototype for a new $24,000 Tesla Cybertruck camper attachment",
   "description": "The Tesla Cybertruck is only weeks away from its delivery event and some companies have already begun building accessories for the EV-pickup truck.",
   "url": "https://www.businessinsider.com/tesla-cybertruck-camper-prototype-model-rv-see-inside-2023-11",
   "urlToImage": "https://i.insider.com/6543e517b788914e554f0f50?width=1200&format=jpeg",
   "publishedAt": "2023-11-05T09:51:01Z",
   "content": "A startup has built a prototype for a camper attachment to the Tesla Cybertruck. This image is a rendering.Courtesy of Space Campers\r\n<ul>\n<li>A startup is looking to sell a $24,000 camper extension … [+6660 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Hackaday"
   },
   "author": "Donald Papp",
   "title": "Most AI Content Is Trash, Just Like Everything Else",
   "description": "[Max Woolf] has been working in the AI space since 2015, and among other work has created numerous useful open-source tools. He also recently wrote a thoughtful blog post that attempts to put into …",
   "url": "https://hackaday.com/2023/11/03/most-ai-content-is-trash-just-like-everything-else/",
   "urlToImage": "https://hackaday.com/wp-content/uploads/2023/11/robots.png",
   "publishedAt": "2023-11-04T02:00:42Z",
   "content": "[Max Woolf] has been working in the AI space since 2015, and among other work has created numerous useful open-source tools. He also recently wrote a thoughtful blog post that attempts to put into wo… [+1773 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Hackaday"
   },
   "author": "Kristina Panos",
   "title": "We Like Big Keyboards and We Cannot Lie",
   "description": "So, let’s say you’re good at DOTA. Like, world-class good. How good do you think you’d be on a keyboard that’s 16 feet long, with a space bar the size of a person? Well, you…",
   "url": "https://hackaday.com/2023/11/07/we-like-big-keyboards-and-we-cannot-lie/",
   "urlToImage": "https://hackaday.com/wp-content/uploads/2023/11/largest-kbd-800.jpg",
   "publishedAt": "2023-11-08T00:00:39Z",
   "content": "So, let’s say you’re good at DOTA. Like, world-class good. How good do you think you’d be on a keyboard that’s 16 feet long, with a space bar the size of a person? Well, you’d need the rest of your t… [+1246 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Hackaday"
   },
   "author": "Jenny List",
   "title": "Making a Solder Paste Stencil From What You Have On Hand",
   "description": "Sometimes there are moments when an engineer has to use whatever materials they have to hand in order to complete the job on time. Such a situation arose at the RevSpace hacker space in Den Haag, N…",
   "url": "https://hackaday.com/2023/11/01/making-a-solder-paste-stencil-from-what-you-have-on-hand/",
   "urlToImage": "https://hackaday.com/wp-content/uploads/2023/10/revspace-stencil-featured.jpg",
   "publishedAt": "2023-11-01T08:00:57Z",
   "content": "Sometimes there are moments when an engineer has to use whatever materials they have to hand in order to complete the job on time. Such a situation arose at the RevSpace hacker space in Den Haag, Net… [+1229 chars]"
  },
  {
   "source": {
    "id": "engadget",
    "name": "Engadget"
   },
   "author": "Mat Smith",
   "title": "The Morning After: Apple’s new MacBook lineup makes much more sense",
   "description": "Apple’s MacBook problem was a confusing lineup of similar machines with different names, different chips, different hardware and the rest. But it may have finally solved the problem. The long-rumored 15-inch MacBook Air arrived months ago, and then Apple surp…",
   "url": "https://www.engadget.com/the-morning-after-apples-new-macbook-lineup-makes-much-more-sense-121543140.html",
   "urlToImage": "https://s.yimg.com/ny/api/res/1.2/XbxNuq2neJjf7pHeN5nFkw--/YXBwaWQ9aGlnaGxhbmRlcjt3PTEyMDA7aD02OTU-/https://s.yimg.com/os/creatr-uploaded-images/2023-11/e5384f80-7c1e-11ee-bd73-50f80f693bba",
   "publishedAt": "2023-11-07T12:15:43Z",
   "content": "Apples MacBook problem was a confusing lineup of similar machines with different names, different chips, different hardware and the rest. But it may have finally solved the problem. The long-rumored … [+2754 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Digital Trends"
   },
   "author": "Georgina Torbet",
   "title": "See the stunning first images taken by the dark matter-hunting Euclid telescope",
   "description": "The European Space Agency has released the first five full-color images taken by Euclid, a space telescope launched earlier this year to probe dark matter.",
   "url": "https://www.digitaltrends.com/space/euclid-first-color-images/",
   "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/11/e1-Horsehead-Nebula.width-12801.jpg?resize=1200%2C630&p=1",
   "publishedAt": "2023-11-08T12:48:27Z",
   "content": "The European Space Agency (ESA) has released the first full-color images taken by Euclid, a space telescope that was launched earlier this year to probe the mysteries of dark matter and dark energy. … [+4314 chars]"
  },
  {
   "source": {
    "id": "bbc-news",
    "name": "BBC News"
   },
   "author": "https://www.facebook.com/bbcnews",
   "title": "Horror games: Is the genre in a golden age?",
   "description": "How do the people behind some of our favourite frightfests come up with ways to keep players scared?",
   "url": "https://www.bbc.co.uk/news/newsbeat-67237646",
   "urlToImage": "https://ichef.bbci.co.uk/news/1024/branded_news/57D4/production/_131548422_horrorindex.jpg",
   "publishedAt": "2023-10-31T00:46:38Z",
   "content": "\"Whaddaya buyin', stranger?\"\r\nIf 2023's videogame sales charts are anything to go by, the answer is \"horror games\".\r\nResident Evil 4 Remake and Dead Space are among the top sellers this year, in a cr… [+6733 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Uncrate.com"
   },
   "author": "Uncrate",
   "title": "Kworks Mio Space Camper",
   "description": "No matter how overbuilt, the odds that any camper is touching any surface more off-road than the gravel of a campsite access road is practically nil. Kworks rather Zen approach to design resulted in the Mio Space, a clean, uncluttered...",
   "url": "https://uncrate.com/kworks-mio-space-camper/",
   "urlToImage": "https://uncrate.com/p/2023/11/kworks-mio-1.jpg",
   "publishedAt": "2023-11-03T00:00:00Z",
   "content": "Hiking presents a unique challenge for sock makers: on one hand, it's an active endeavor, but on the other, it's often done in cooler weather. Thus you need a sock that's breathable and moisture-wick… [+409 chars]"
  },
  {
   "source": {
    "id": "business-insider",
    "name": "Business Insider"
   },
   "author": "Bryan Metzger",
   "title": "John Fetterman predicts Joe Manchin is 'not going to be around much longer' in the Senate: 'I'm going to get his parking space'",
   "description": "The Pennsylvania senator's missive against his party's most vulnerable 2024 incumbent came after Manchin led a resolution to reinstate the dress code.",
   "url": "https://www.businessinsider.com/fetterman-manchin-dress-code-not-senator-much-longer-2023-11",
   "urlToImage": "https://i.insider.com/6544f383b788914e554f8c48?width=1200&format=jpeg",
   "publishedAt": "2023-11-03T14:12:28Z",
   "content": "Democratic Sens. John Fetterman of Pennsylvania and Joe Manchin of West Virginia.Tom Williams/CQ-Roll Call via Getty Images\r\n<ul>\n<li>Sen. John Fetterman predicted that fellow Democratic Sen. Joe Man… [+2182 chars]"
  },
  {
   "source": {
    "id": "business-insider",
    "name": "Business Insider"
   },
   "author": "Sonam Sheth",
   "title": "NASA sent a spaceship rocketing by an asteroid — and discovered the space rock has a little baby one dancing around it",
   "description": "NASA's Lucy spacecraft discovered that the asteroid Dinkinesh is actually a binary asteroid system.",
   "url": "https://www.businessinsider.com/nasa-sent-spaceship-near-dinkinesh-asteroid-discovered-second-baby-one-2023-11",
   "urlToImage": "https://i.insider.com/65453fe13cc84b4dfafc3b75?width=1200&format=jpeg",
   "publishedAt": "2023-11-03T18:46:17Z",
   "content": "A rendering of NASA's Lucy Spacecraft and images of the binary asteroid system Dinkinesh — nicknamed \"Dinky.\"NASA\r\n<ul><li>NASA sent a spacecraft flying by the Dinkinesh asteroid.</li><li>The agency … [+1652 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Digital Trends"
   },
   "author": "Trevor Mogg",
   "title": "Spot the space station with this new NASA app",
   "description": "A new app released for iOS and Android makes it easier than ever to spot the International Space Station when it passes overhead.",
   "url": "https://www.digitaltrends.com/space/spot-the-space-station-with-this-new-nasa-app/",
   "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/11/international-space-station.jpg?resize=1200%2C630&p=1",
   "publishedAt": "2023-11-03T01:55:57Z",
   "content": "NASA\r\nThe International Space Station (ISS) orbits Earth 16 times a day, which means that at some point it’s likely to pass over your neighborhood.\r\nDespite being 250 miles above our heads, it’s actu… [+1986 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Themarginalian.org"
   },
   "author": "Maria Popova",
   "title": "The Warped Side of Our Universe: A Painted Epic Poem about the Dazzling Science of Spacetime",
   "description": "The first English use of the word space to connote the cosmic expanse appears in line 650 of Book I of Milton’s epic poem Paradise Lost: “Space may produce new Worlds,” he wrote, and grow rife with them. In the centuries since Milton, who lived through the go…",
   "url": "https://www.themarginalian.org/2023/10/31/the-warped-side-of-our-universe-lia-halloran-kip-thorne/",
   "urlToImage": "https://www.themarginalian.org/wp-content/uploads/2023/10/liahalloran_warpedside0.jpg?fit=1200%2C630&ssl=1",
   "publishedAt": "2023-10-31T22:21:31Z",
   "content": "The first English use of the word space to connote the cosmic expanse appears in line 650 of Book I of Miltons epic poem Paradise Lost: Space may produce new Worlds, he wrote, and grow rife with them… [+4449 chars]"
  },
  {
   "source": {
    "id": "wired",
    "name": "Wired"
   },
   "author": "Megan Wollerton",
   "title": "Peloton Row Review: A Nearly Perfect Rowing Machine With a Too-High Price",
   "description": "I’m almost annoyed by how much I like this premium hunk of metal.",
   "url": "https://www.wired.com/review/peloton-row/",
   "urlToImage": "https://media.wired.com/photos/654abad5b1588e8b68aaa8fa/191:100/w_1280,c_limit/Peloton-Row-Review-Featured-Gear.jpg",
   "publishedAt": "2023-11-08T13:00:00Z",
   "content": "On mornings when the conditions were too poor to hit the water, my high school crew team was relegated to practicing in a dank garage overlooking the roiling Ohio river. Still dark at the outset, hea… [+3015 chars]"
  },
  {
   "source": {
    "id": "wired",
    "name": "Wired"
   },
   "author": "Alex Miller",
   "title": "Tech and Games Can Help Curb Youth Suicide",
   "description": "In the face of lackluster mental health support, especially for children of marginalized groups, technology and video games can be used to meet young people where they are.",
   "url": "https://www.wired.com/story/tech-video-games-youth-suicide/",
   "urlToImage": "https://media.wired.com/photos/65452a95ae2b61a93847eea7/191:100/w_1280,c_limit/w30-youth-suicides-tech-games.jpg",
   "publishedAt": "2023-11-07T12:00:00Z",
   "content": "One of my most traumatizing moments was when my best friend Terry got gunned down outside my projects. As a 9-year-old in Chicago, I remember always speaking to him about whether he thought we would … [+3213 chars]"
  },
  {
   "source": {
    "id": "wired",
    "name": "Wired"
   },
   "author": "Matt Jancer",
   "title": "REI Co-op 650 Down Jacket Review: Best Value",
   "description": "Big, puffy jackets tend to have big, puffy prices. The 650 Down Jacket from REI improves on its predecessor for a little extra coin.",
   "url": "https://www.wired.com/review/rei-co-op-650-down-jacket/",
   "urlToImage": "https://media.wired.com/photos/654a6a7cb1588e8b68aaa8f2/191:100/w_1280,c_limit/REI-Co-op-650-Down-Jacket-Review-Featured-Gear.jpg",
   "publishedAt": "2023-11-08T13:00:00Z",
   "content": "REI Co-opthe house brand for outdoor retailer REIconsistently strikes an impressive balance between quality and price. The latest example is the 650 Down Jacket, which is lightweight, made of recycle… [+2718 chars]"
  },
  {
   "source": {
    "id": "the-verge",
    "name": "The Verge"
   },
   "author": "Jennifer Pattison Tuohy",
   "title": "TP-Link’s teeny-tiny security camera offers a lot for very little",
   "description": "The Tapo C120 is a capable $40 2K indoor / outdoor wired camera with local storage, built-in spotlights, and free pet, person, and vehicle detection.",
   "url": "https://www.theverge.com/2023/11/1/23941020/tp-link-tapo-c120-indoor-outdoor-security-camera-price-release-date",
   "urlToImage": "https://cdn.vox-cdn.com/thumbor/YQ_cGzdWO7tpTtNFeO1KkevrAPI=/0x0:7008x4672/1200x628/filters:focal(4940x1928:4941x1929)/cdn.vox-cdn.com/uploads/chorus_asset/file/25048577/DSC9408.jpg",
   "publishedAt": "2023-11-01T16:14:35Z",
   "content": "TP-Links teeny-tiny security camera offers a lot for very little\r\nTP-Links teeny-tiny security camera offers a lot for very little\r\n / The Tapo C120 is a versatile indoor / outdoor wired camera that … [+2748 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Boing Boing"
   },
   "author": "Rob Beschizza",
   "title": "Apple's new MacBook comes in black",
   "description": "As handsome as Apple's inky blue \"Midnight\" color option is, it's not a true black—not like the new M3 MacBook Pro announce last night. The pricey, powerful machine comes in \"Space Black,\" representing the line's darkest turn in 15 years. — Read the rest",
   "url": "https://boingboing.net/2023/10/31/apples-new-macbook-comes-in-black.html",
   "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2023/10/image-153.png?fit=1200%2C675&ssl=1",
   "publishedAt": "2023-10-31T13:42:55Z",
   "content": "As handsome as Apple's inky blue \"Midnight\" color option is, it's not a true blacknot like the new M3 MacBook Pro announce last night. The pricey, powerful machine comes in \"Space Black,\" representin… [+1262 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "9to5Mac"
   },
   "author": "Derek Wise",
   "title": "NASA launches new app to see the International Space Station",
   "description": "On Thursday, NASA launched a new app to make it easier than ever to spot the International Space Station in the night sky. NASA has long operated the Spot the Station website, but their new app, available on both iPhone and Android, brings augmented reality f…",
   "url": "https://9to5mac.com/2023/11/02/nasa-launches-new-app-to-see-the-international-space-station/",
   "urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2023/11/nasa-spot-the-station.webp?resize=1200%2C628&quality=82&strip=all&ssl=1",
   "publishedAt": "2023-11-02T19:35:29Z",
   "content": "On Thursday, NASA launched a new app to make it easier than ever to spot the International Space Station in the night sky. NASA has long operated the Spot the Station website, but their new app, avai… [+2143 chars]"
  },
  {
   "source": {
    "id": "engadget",
    "name": "Engadget"
   },
   "author": "Devindra Hardawar",
   "title": "MacBook Pro 14-inch and 16-inch review: An M3 chip for every situation",
   "description": "Apple's confusing laptop family finally makes sense this year. The long-rumored 15-inch MacBook Air arrived months ago, and the company surprised us by delivering two MacBook Pro revisions in less than 12 months. While I appreciated the speed bump that the M2…",
   "url": "https://www.engadget.com/macbook-pro-14-inch-and-16-inch-review-an-m3-chip-for-every-situation-140048075.html",
   "urlToImage": "https://s.yimg.com/uu/api/res/1.2/fJ97.mWs4qpHtyswCb1EqQ--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2023-11/e5384f80-7c1e-11ee-bd73-50f80f693bba.cf.jpg",
   "publishedAt": "2023-11-06T14:00:48Z",
   "content": "Apple's confusing laptop family finally makes sense this year. The long-rumored 15-inch MacBook Air arrived months ago, and the company surprised us by delivering two MacBook Pro revisions in less th… [+9436 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Gizmodo.com"
   },
   "author": "Linda Codega",
   "title": "The Gaming Shelf Haunts The Woods at Blight's Hollow",
   "description": "Believe it or not, after two decades, Brandon Sanderson’s Stormlight Archive is getting a TTRPG. This isn’t breaking news—it was announced well before Gen Con this year—but the reveal of its three team writers and designers is. Additionally, MCDM has announce…",
   "url": "https://gizmodo.com/gaming-shelf-ttrpg-horror-folklore-games-halloween-1850949602",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/497797d9b6ab0932c24deca7ce39a95c.png",
   "publishedAt": "2023-10-31T15:45:00Z",
   "content": "The Woods at Blights Hollow is a TTRPG of folk horror and fairy tales inspired by Angela Carter, Guillermo del Toro, and Robert Eggers. Based on Brindlewood Bay, the game sees the children of Blights… [+2131 chars]"
  },
  {
   "source": {
    "id": "polygon",
    "name": "Polygon"
   },
   "author": "Polygon Staff",
   "title": "The best movies on Max right now",
   "description": "The best movies you can watch at home on Max right now, from Dune and The Batman to 2001: A Space Odyssey, Lord of the Rings, and The Matrix.",
   "url": "https://www.polygon.com/what-to-watch/23435110/best-movies-watch-max-hbo-streaming",
   "urlToImage": "https://cdn.vox-cdn.com/thumbor/3eXuUZ-HpI1J0D0-7LrlyVr6nik=/0x203:3630x2104/fit-in/1200x630/cdn.vox-cdn.com/uploads/chorus_asset/file/25044778/MBDLARO_EC010.jpg",
   "publishedAt": "2023-11-01T16:24:17Z",
   "content": "Max has gone through quite a transformation since the days of its initial launch in 2020. Following the unprecedented day-and-date release of the studios entire film slate in 2021, Maxs reach has con… [+14287 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Scientific American"
   },
   "author": "Meghan Bartels",
   "title": "NASA's Lucy Asteroid Mission Zips Past a 'Dinky' Space Rock",
   "description": "NASA&rsquo;s Lucy mission is starting its science studies way ahead of schedule",
   "url": "https://www.scientificamerican.com/article/nasas-lucy-asteroid-mission-zips-past-a-dinky-space-rock/",
   "urlToImage": "https://static.scientificamerican.com/sciam/cache/file/71B8087F-1598-4523-BF88CC37DBD6821B.jpg",
   "publishedAt": "2023-11-01T11:00:00Z",
   "content": "On November 1 a NASA spacecraft called Lucy will introduce humans to a world called Dinkinesh—nicknamed Dinky—the smallest main-belt asteroid we’ve ever seen up close.\r\nLucy launched in 2021 to explo… [+6339 chars]"
  },
  {
   "source": {
    "id": "business-insider",
    "name": "Business Insider"
   },
   "author": "Adam Rogers",
   "title": "Don’t blame the pandemic for all the empty storefronts on your street. Blame big banks.",
   "description": "Landlords could help reverse the Retail Apocalypse by lowering rents and extending leases — but their lenders won't let them.",
   "url": "https://www.businessinsider.com/bank-financing-urban-planning-pandemic-retail-apocalypse-vacant-storefront-2023-10",
   "urlToImage": "https://i.insider.com/65402610356802a56be808f6?width=1200&format=jpeg",
   "publishedAt": "2023-10-31T09:55:01Z",
   "content": "Landlords could help reverse the Retail Apocalypse by lowering rents and extending leases — but their lenders won’t let them.Tyler Le/Insider\r\nYou've probably seen it in your own neighborhood. Some r… [+10413 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Slashdot.org"
   },
   "author": "BeauHD",
   "title": "NASA Open To Extending ISS Beyond 2030",
   "description": "Jeff Foust reports via SpaceNews: A NASA official opened the door to keeping the International Space Station in operation beyond 2030 if commercial space stations are not yet ready to take over by the end of the decade. Speaking at the Beyond Earth Symposium …",
   "url": "https://science.slashdot.org/story/23/11/03/235229/nasa-open-to-extending-iss-beyond-2030",
   "urlToImage": "https://a.fsdn.com/sd/topics/iss_64.png",
   "publishedAt": "2023-11-04T07:00:00Z",
   "content": "A NASA official opened the door to keeping the International Space Station in operation beyond 2030 if commercial space stations are not yet ready to take over by the end of the decade. Speaking at t… [+1458 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Boing Boing"
   },
   "author": "David Pescovitz",
   "title": "Astronaut on space station captures astonishing image of massive skull peering up from volcanic pit on Earth",
   "description": "An astronaut aboard the International Space Station snapped this astonishing photo in February of a massive skull peering up from a volcanic pit on Earth. The skull is located 1,000 meters down in Trou au Natron, a volcanic pit and soda lake in northern Chad.…",
   "url": "https://boingboing.net/2023/11/07/astronaut-on-space-station-captures-astonishing-image-of-massive-skull-peering-up-from-volcanic-pit-on-earth.html",
   "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2023/11/iss068e053507zm.jpg?fit=1200%2C800&ssl=1",
   "publishedAt": "2023-11-07T15:30:31Z",
   "content": "An astronaut aboard the International Space Station snapped this astonishing photo in February of a massive skull peering up from a volcanic pit on Earth. The skull is located 1,000 meters down in Tr… [+852 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Design-milk.com"
   },
   "author": "Vy Yang",
   "title": "The Heart of This Warehouse Office Is Community",
   "description": "This Tustin, California office features an interior biophilic courtyard meant for collaboration and easy circulation to the department \"neighborhoods.\"",
   "url": "https://design-milk.com/the-heart-of-this-warehouse-office-is-community/",
   "urlToImage": "https://design-milk.com/images/2023/10/shubin-donaldson-architects-tricon-office-23.jpg",
   "publishedAt": "2023-11-02T16:00:26Z",
   "content": "While some companies boast about community being the center of their business, Tustin, California-based Tricon Residential is physically built for it. Designed by Shubin Donaldson Architects, the new… [+1168 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "MacRumors"
   },
   "author": "Joe Rossignol",
   "title": "New MacBook Pro Reviews: Scary Fast, But M3 Pro Chip Has a Catch",
   "description": "Last week, Apple updated the 14-inch and 16-inch MacBook Pro models with M3 Pro and M3 Max chips for faster performance. There is also an entry-level 14-inch MacBook Pro with the standard M3 chip. Other new features include a Space Black finish for M3 Pro and…",
   "url": "https://www.macrumors.com/review/m3-macbook-pro/",
   "urlToImage": "https://images.macrumors.com/t/ioCiSxI7bwOKwbWI8hOW5_n9W2o=/1600x/article-new/2023/10/m3-mbp-space-black.jpg",
   "publishedAt": "2023-11-06T15:24:52Z",
   "content": "Last week, Apple updated the 14-inch and 16-inch MacBook Pro models with M3 Pro and M3 Max chips for faster performance. There is also an entry-level 14-inch MacBook Pro with the standard M3 chip. Ot… [+4331 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Apartment Therapy"
   },
   "author": "Quinn Fish",
   "title": "This Storage Hack \"Conquered\" My Bag Clutter (Without Taking Up Any Space)",
   "description": "Plus, it’s great for storing other accessories, too.\nREAD MORE...",
   "url": "https://www.apartmenttherapy.com/diy-purse-storage-hack-37337997",
   "urlToImage": "https://cdn.apartmenttherapy.info/image/upload/f_auto,q_auto:eco,c_fill,g_auto,w_1500,ar_3:2/stock%2FGettyImages-1048848192",
   "publishedAt": "2023-11-08T13:30:00Z",
   "content": "We independently select these products—if you buy from one of our links, we may earn a commission. All prices were accurate at the time of publishing.\r\nAm I the only one with so many purses, totes, a… [+3451 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Food52.com"
   },
   "author": "Julia Gómez Kramer",
   "title": "These 8 Furniture Essentials Will Upgrade Any Space",
   "description": "We’ve teamed up with our friends at Wayfair to share some of our favorite ways to upgrade your space. Psst! All of these products also happen to be on sale—along with others across the site that are discounted up to 70 percent off—as part of Wayfair's Cyber M…",
   "url": "https://food52.com/blog/28240-wayfair-furniture-essentials-that-will-upgrade-any-space",
   "urlToImage": "https://images.food52.com/EoNFMhLDcZ4d6mdbzgNFL2HZW3c=/fit-in/1200x1200/0a57e340-a538-4a65-849e-eea5238da86e--Untitled_design_2023-09-01T121327.323.jpg",
   "publishedAt": "2023-11-01T15:50:58Z",
   "content": "Weve teamed up with our friends at Wayfair to share some of our favorite ways to upgrade your space. Psst! All of these products also happen to be on salealong with others across the site that are di… [+3748 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "MacRumors"
   },
   "author": "Mitchel Broussard",
   "title": "Touch Bar Fans: Get the 13-Inch M2 MacBook Pro for $250 Off Before It's Gone",
   "description": "The 13-inch M2 MacBook Pro has been discontinued in the wake of the announcement of the new 14-inch and 16-inch MacBook Pro. Because of this, we're tracking a few last-chance deals on the previous generation computer that should be enticing for anyone who wan…",
   "url": "https://www.macrumors.com/2023/10/31/touch-bar-fans-m2-macbook-pro/",
   "urlToImage": "https://images.macrumors.com/t/1NnFf7Tlo75N_2YQO-rfzr7vKbw=/1600x/article-new/2023/08/macbook-pro-school.jpg",
   "publishedAt": "2023-10-31T15:52:02Z",
   "content": "The 13-inch M2 MacBook Pro has been discontinued in the wake of the announcement of the new 14-inch and 16-inch MacBook Pro. Because of this, we're tracking a few last-chance deals on the previous ge… [+992 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Digital Trends"
   },
   "author": "Trevor Mogg",
   "title": "Watch NASA’s trailer teasing next week’s launch of streaming service",
   "description": "NASA has shared a trailer highlighting next week’s launch of NASA+, a free video streaming service aimed at space fans.",
   "url": "https://www.digitaltrends.com/space/nasa-trailer-teases-launch-of-nasa-streaming-service/",
   "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2022/07/nasa-sls-rocket.jpg?resize=1200%2C630&p=1",
   "publishedAt": "2023-11-02T03:15:04Z",
   "content": "NASA has shared a trailer highlighting next week’s launch of NASA+, a free video streaming service.\r\n“We launch more than rockets,” NASA said in a post about the new offering, adding: “No subscriptio… [+1607 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Kotaku"
   },
   "author": "Claire Jackson",
   "title": "Modern Warfare III and Starfield Highlight An Obnoxious Trend",
   "description": "Every week I play a very specific game. No, it’s not Halo (though I do occasionally play that), but the game where I desperately try to manage the storage space on my PC because of video games. Oh and if I go to my PS5, trying to curate a decent list of insta…",
   "url": "https://kotaku.com/install-size-modern-warfare-3-starfield-1850995344",
   "urlToImage": "https://i.kinja-img.com/image/upload/c_fill,h_675,pg_1,q_80,w_1200/a3583290a6f88400eb863ff12fcf4245.jpg",
   "publishedAt": "2023-11-06T18:00:00Z",
   "content": "Every week I play a very specific game. No, its not Halo (though I do occasionally play that), but the game where I desperately try to manage the storage space on my PC because of video games. Oh and… [+4365 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "ReadWrite"
   },
   "author": "Radek Zielinski",
   "title": "Google backs out of $15B bay area campus deals",
   "description": "Google has terminated its contracts with Australian developer Lendlease for four major Bay Area development projects. According to a Nov. […]\nThe post Google backs out of $15B bay area campus deals appeared first on ReadWrite.",
   "url": "https://readwrite.com/google-backs-out-of-15b-bay-area-campus-deals/",
   "urlToImage": "https://readwrite.com/wp-content/uploads/2023/11/Google-backs-out-of-Bay-area-campus.jpg",
   "publishedAt": "2023-11-04T13:00:31Z",
   "content": "Google has terminated its contracts with Australian developer Lendlease for four major Bay Area development projects.\r\nAccording to a Nov. 2 CNBC report, the canceled deals include plans for new Goog… [+2394 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Harvard Business Review"
   },
   "author": null,
   "title": "NASA’s Former Head of Science on What It Takes to Manage Complex, High-Risk Projects",
   "description": "How to lead extremely technical, complex, and expensive projects with a high risk of failure.",
   "url": "https://hbr.org/podcast/2023/11/nasas-former-head-of-science-on-what-it-takes-to-manage-complex-high-risk-projects",
   "urlToImage": "https://hbr.org/resources/images/article_assets/2023/05/wide-hbr-on-leadership.png",
   "publishedAt": "2023-11-01T12:02:00Z",
   "content": "As the head of science at NASA, Thomas Zurbuchen managed an $8.6 billion dollar budget. A typical Monday, for him, might have involved hitting an asteroid with a space craft or trying to launch a roc… [+3 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "CNET"
   },
   "author": "Max McHone",
   "title": "Save 20% Sitewide on CamelBak Packs, Water Bottles and Much More - CNET",
   "description": "Snag gear for your next adventure or a great gift for the outdoorsy folks in your life with these sitewide savings.",
   "url": "https://www.cnet.com/deals/save-20-sitewide-on-camelbak-packs-water-bottles-and-much-more/",
   "urlToImage": "https://www.cnet.com/a/img/resize/417345e1e7ec9e63e8cecea19b2b962575321a83/hub/2023/11/07/76f976de-83e3-4f9a-80b7-df3b3e654241/camelbak-x-pow-hydration-pack.jpg?auto=webp&fit=crop&height=675&width=1200",
   "publishedAt": "2023-11-07T15:45:00Z",
   "content": "CamelBak makes some of the most rugged hydration packs and drinkware on the market. And whether you're getting ready for some cold weather adventures, are gearing up for next season or gift shopping … [+1373 chars]"
  },
  {
   "source": {
    "id": "business-insider",
    "name": "Business Insider"
   },
   "author": "Sophia Carlisle",
   "title": "The best early Black Friday kitchen appliance deals: Save up to 25% on LG and Whirlpool refrigerators",
   "description": "We're seeing great early Black Friday deals on big items like cooktops, refrigerators, and dishwashers. Here are the best kitchen appliance deals.",
   "url": "https://www.businessinsider.com/guides/deals/kitchen-appliance-deals",
   "urlToImage": "https://i.insider.com/6542a6e03cc84b4dfafa1579?width=1200&format=jpeg",
   "publishedAt": "2023-11-02T16:12:19Z",
   "content": "When you buy through our links, Insider may earn an affiliate commission. Learn moreBest Buy; Insider\r\nThe biggest shopping holiday of the year is still be a few weeks away, but the best Black Friday… [+2041 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Boing Boing"
   },
   "author": "Rob Beschizza",
   "title": "WeWork was once \"valued\" at $47 billion. Now it's bankrupt",
   "description": "WeWork, described as an \"office-sharing company\", filed for Chapter 11 bankruptcy protection on Monday. Once \"valued\" at $47bn, the company leased office space hoping to lease it to others for more money than it was paying. It tried and failed to go public, t…",
   "url": "https://boingboing.net/2023/11/07/wework-was-once-valued-at-47-billion-now-its-bankrupt.html",
   "urlToImage": "https://i0.wp.com/boingboing.net/wp-content/uploads/2023/11/shutterstock_2159023891-scaled.jpg?fit=1200%2C624&ssl=1",
   "publishedAt": "2023-11-07T12:48:08Z",
   "content": "WeWork, described as an \"office-sharing company\", filed for Chapter 11 bankruptcy protection on Monday. Once \"valued\" at $47bn, the company leased office space hoping to lease it to others for more m… [+1201 chars]"
  },
  {
   "source": {
    "id": "engadget",
    "name": "Engadget"
   },
   "author": "Sam Rutherford",
   "title": "HP Spectre Fold review: Cutting edge at all costs",
   "description": "It’s rare, but now and then a company will go out on a limb and create a truly cutting-edge device, even if its books take a hit. That’s exactly what HP has done with the Spectre Fold. Despite having the same processor as last year’s ASUS Zenbook 17 OLED, HP’…",
   "url": "https://www.engadget.com/hp-spectre-fold-review-cutting-edge-at-all-costs-specs-price-153025668.html",
   "urlToImage": "https://s.yimg.com/uu/api/res/1.2/80EUOEWo.FaLRiZ3AqHORQ--~B/Zmk9ZmlsbDtoPTYzMDtweW9mZj0wO3c9MTIwMDthcHBpZD15dGFjaHlvbg--/https://media-mbst-pub-ue1.s3.amazonaws.com/creatr-uploaded-images/2023-11/317880b0-7e48-11ee-8e7b-40565a49e519.cf.jpg",
   "publishedAt": "2023-11-08T15:30:25Z",
   "content": "Its rare, but now and then a company will go out on a limb and create a truly cutting-edge device, even if its books take a hit. Thats exactly what HP has done with the Spectre Fold. Despite having t… [+5523 chars]"
  },
  {
   "source": {
    "id": "business-insider",
    "name": "Business Insider"
   },
   "author": "Chris Dong",
   "title": "Capital One just opened a new airport lounge in Denver, and some credit cardholders can bring guests for free",
   "description": "Capital One's latest airport lounge is in Concourse A of the Denver International Airport, and anyone can purchase a day pass for entry.",
   "url": "https://www.businessinsider.com/personal-finance/capital-one-denver-airport-lounge-2023-11",
   "urlToImage": "https://i.insider.com/654541633cc84b4dfafc3e87?width=1200&format=jpeg",
   "publishedAt": "2023-11-03T21:30:24Z",
   "content": "Our experts answer readers' credit card questions and write unbiased product reviews (here's how we assess credit cards). In some cases, we receive a commission from our partners; however, our opinio… [+8150 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Digital Trends"
   },
   "author": "Luke Larsen",
   "title": "I saw the new Space Black MacBook Pro, and it’s stunning",
   "description": "Apple has announced a new color option for the MacBook Pro, and after seeing it in person, I'm smitten.",
   "url": "https://www.digitaltrends.com/computing/space-black-macbook-pro-is-stunning/",
   "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/10/Apple-MacBook-Pro-2up_screen.jpg?resize=1200%2C630&p=1",
   "publishedAt": "2023-10-31T00:30:53Z",
   "content": "Apple\r\nIt’s not often that MacBook Pros get new color options. But with this most recent update to M3 chips, the MacBook Pro will add Space Black, a color that first appeared on the iPhone, to the mi… [+1507 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "9to5Mac"
   },
   "author": "Chance Miller",
   "title": "Does Apple’s ‘anodization seal’ on the space black MacBook Pro actually reduce fingerprints?",
   "description": "While the new MacBook Pro in space black is getting a lot of attention, Apple actually started its march toward darker-shaded laptops . One key difference, however, is that Apple claims the space black color on the MacBook Pro solves the fingerprint and durab…",
   "url": "https://9to5mac.com/2023/10/31/space-black-macbook-pro-fingerprints/",
   "urlToImage": "https://i0.wp.com/9to5mac.com/wp-content/uploads/sites/6/2023/10/macbook-pro-fingerprints.jpg?resize=1200%2C628&quality=82&strip=all&ssl=1",
   "publishedAt": "2023-10-31T15:29:48Z",
   "content": "While the new MacBook Pro in space black is getting a lot of attention, Apple actually started its march toward darker-shaded laptops with the MacBook Air in midnight. One key difference, however, is… [+2957 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "MacRumors"
   },
   "author": "Tim Hardwick",
   "title": "M3 iMac and MacBook Pro Models Now Available for Same-Day Pickup",
   "description": "Starting today, Apple's refreshed M3 iMac and MacBook Pro models with M3 and M3 Pro chips are available for same-day or next-day pickup at Apple Stores, with no pre-order required. Online orders are also beginning to arrive to customers today. \n\n\n\n\n\nCustomers…",
   "url": "https://www.macrumors.com/2023/11/07/m3-imac-macbook-pro-now-available/",
   "urlToImage": "https://images.macrumors.com/t/38K6r-OX2SrbG7JYIv7w_Ghj2Zg=/1600x/article-new/2023/10/m3-imac.jpg",
   "publishedAt": "2023-11-07T11:16:21Z",
   "content": "Starting today, Apple's refreshed M3 iMac and MacBook Pro models with M3 and M3 Pro chips are available for same-day or next-day pickup at Apple Stores, with no pre-order required. Online orders are … [+1652 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Cool Hunting"
   },
   "author": "Evan Orensten",
   "title": "The Cowie Collection Glass",
   "description": "This chic spirit sipping glass was designed to showcase the spirit’s color, provide space for aromas, and to create a bit of “audacious” drama. Commissioned by Mortlach whisky and designed by Felicia …",
   "url": "http://coolhunting.com/buy/the-cowie-collection-glass/",
   "urlToImage": "https://150102931.v2.pressablecdn.com/wp-content/uploads/2023/11/M22_square_1152x1152.jpg",
   "publishedAt": "2023-11-08T12:55:49Z",
   "content": "MYSTERY RANCH + CarryologyThe Unicorn 2.0 backpack, a new collaboration between Bozeman, Montana-based pack-maker MYSTERY RANCH and the bag-authority publication Carryology releases 31 October at 1pm… [+1055 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Asignin.space"
   },
   "author": "Daniela de Paulis",
   "title": "Show HN: A Sign In Space – simulating a message from ET",
   "description": "A Sign in Space is an interdisciplinary project by media artist Daniela de Paulis, in collaboration with the SETI Institute, the European Space Agency, the Green Bank Observatory and INAF, the Italian National Institute for Astrophysics.The project consists i…",
   "url": "https://asignin.space/",
   "urlToImage": "https://asignin.space/wp-content/uploads/2022/12/white_logo_black_background.png",
   "publishedAt": "2023-11-01T15:09:00Z",
   "content": "A Sign in Space is an interdisciplinary project by media artist Daniela de Paulis, in collaboration with the SETI Institute, the European Space Agency, the Green Bank Observatory and INAF, the Italia… [+606 chars]"
  },
  {
   "source": {
    "id": "wired",
    "name": "Wired"
   },
   "author": "Matt Burgess",
   "title": "This Cheap Hacking Device Can Crash Your iPhone With Pop-Ups",
   "description": "Plus: SolarWinds is charged with fraud, New Orleans police face recognition has flaws, and new details about Okta’s October data breach emerge.",
   "url": "https://www.wired.com/story/flipper-zero-iphone-dos-attack-security-roundup/",
   "urlToImage": "https://media.wired.com/photos/65450b438e91e3ca88ad9cbb/191:100/w_1280,c_limit/Flipper-Zero-Security-Roundup.jpg",
   "publishedAt": "2023-11-04T13:00:00Z",
   "content": "As the Israel-Hamas war continues, with Israeli troops moving into the Gaza Strip and encircling Gaza City, one piece of technology is having an outsized impact on how we see and understand the war. … [+5730 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Digital Trends"
   },
   "author": "Georgina Torbet",
   "title": "How to watch SpaceX deliver cargo and experiments to the ISS this week",
   "description": "This week will see a SpaceX Dragon spacecraft blast off from NASA's Kennedy Space Center and head for the ISS to deliver supplies and research.",
   "url": "https://www.digitaltrends.com/space/spacex-29th-cargo-iss-livestream/",
   "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/11/52218485170-1576ef4f06-k1.jpg?resize=1200%2C630&p=1",
   "publishedAt": "2023-11-06T03:10:35Z",
   "content": "This week will see a SpaceX Dragon spacecraft blast off from NASA’s Kennedy Space Center in Florida and head for the International Space Station (ISS) to deliver supplies and research to the crew the… [+2352 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Digital Trends"
   },
   "author": "Trevor Mogg",
   "title": "NASA just launched a free streaming channel called NASA+",
   "description": "NASA has just launched a new ad-free channel called NASA+ that offers original shows and live content for space fans around the world.",
   "url": "https://www.digitaltrends.com/space/nasa-free-streaming-channel-nasa/",
   "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2022/10/pillars-of-creation.jpg?resize=1200%2C630&p=1",
   "publishedAt": "2023-11-09T02:10:19Z",
   "content": "NASA's On-Demand Streaming Service, NASA+ (Official Trailer)\r\nNASA launched a free video streaming channel on Wednesday.\r\nCalled NASA+, the new ad-free channel offers original shows and live content … [+1684 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "NPR"
   },
   "author": "Adam Frank",
   "title": "In 'White Holes,' Carlo Rovelli takes readers beyond the black hole horizon",
   "description": "Physicist Carlo Rovelli is unique among modern scientists who write for popular audiences in his ability to capture the purest essence of his science with both precision and lyricism.",
   "url": "https://www.npr.org/2023/10/31/1209487538/book-review-carlo-rovelli-white-holes",
   "urlToImage": "https://media.npr.org/assets/img/2023/10/31/white_wide-b7c42e257a72f24b0ca70976f602554887939327-s1400-c100.jpg",
   "publishedAt": "2023-10-31T15:35:32Z",
   "content": "Horizons are weird. They delimit what we can see in the distance, but they are also always personal: Walk 10 miles to the west and your horizon line moves 10 miles to the west with you.\r\nRemarkably, … [+4672 chars]"
  },
  {
   "source": {
    "id": null,
    "name": "Digital Trends"
   },
   "author": "Trevor Mogg",
   "title": "NASA releases ‘ghostly cosmic hand’ image for Halloween",
   "description": "To help you get in the mood for Halloween, NASA has released a spooky image from deep space showing what it describes as a ghostly cosmic hand.",
   "url": "https://www.digitaltrends.com/space/nasa-releases-ghostly-cosmic-hand-image-for-halloween/",
   "urlToImage": "https://www.digitaltrends.com/wp-content/uploads/2023/10/msh-15-52.jpeg?resize=1200%2C630&p=1",
   "publishedAt": "2023-10-31T03:10:33Z",
   "content": "To mark Halloween, NASA has released a spooky image of what it describes as a “ghostly cosmic hand.”\r\nIt actually shows MSH 15-52, a cloud of energetic particles that resembles a human hand.\r\nNASA’s … [+1544 chars]"
  }
 ]
}